# ============================================================================== #
#                                                                                #
#   Apps — Пользовательские графические приложения                               #
#                                                                                #
# ============================================================================== #
{ config, pkgs, ... }:

{
  home.packages = with pkgs; [
    # ── Браузеры ─────────────────────────────────────────────────────────────
    firefox
    chromium

    # ── Мессенджеры ──────────────────────────────────────────────────────────
    telegram-desktop

    # ── IDE и Разработка ─────────────────────────────────────────────────────
    antigravity-fhs

    # ── Системные иконки ─────────────────────────────────────────────────────
    networkmanagerapplet  # nm-applet (VPN/WiFi в трее)
  ];
}
